In [1]:
import pandas as pd

In [2]:
# pandas GroupBy function is used to split the data into groups based on some criteria

Any groupby operation involves one of the following operation on the original object


-splitting the object

-applying the function

-combining the result

In [6]:
df=  pd.read_csv('data/student_result1.csv')
df

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

In [7]:
grp1=df.groupby(by='Section')

In [8]:
grp1.groups

{'A': Int64Index([0, 2], dtype='int64'),
 'B': Int64Index([1], dtype='int64'),
 'C': Int64Index([3, 4], dtype='int64')}

In [9]:
df.groupby(by=['Section','Class']).groups

{('A', 10): Int64Index([0, 2], dtype='int64'),
 ('B', 10): Int64Index([1], dtype='int64'),
 ('C', 11): Int64Index([3], dtype='int64'),
 ('C', 12): Int64Index([4], dtype='int64')}

In [10]:
for Class,df_1 in grp1:
    print(Class)
    print(df_1)

A
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60
B
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
1        1002       B     10          6                       2          80
C
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

In [11]:
list(grp1)

[('A',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  0        1001       A     10          2                       3          50
  2        1003       A     10          3                       2          60),
 ('B',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  1        1002       B     10          6                       2          80),
 ('C',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  3        1004       C     11          0                       1          45
  4        1005       C     12          5                       2          75)]

In [13]:
dict(list(grp1))

{'A':    Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
 0        1001       A     10          2                       3          50
 2        1003       A     10          3                       2          60,
 'B':    Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
 1        1002       B     10          6                       2          80,
 'C':    Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
 3        1004       C     11          0                       1          45
 4        1005       C     12          5                       2          75}

In [14]:
grp2 = df.groupby('Class').get_group(10)
grp2

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60

In [16]:
grp4 = df.groupby('Section').get_group('A')
grp4

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60

In [17]:
grp4.sum()

Student ID                2004
Section                     AA
Class                       20
Study hrs                    5
Social Media usage hrs       5
Percentage                 110
dtype: object

In [19]:
grp4.mean()

Student ID                1002.0
Class                       10.0
Study hrs                    2.5
Social Media usage hrs       2.5
Percentage                  55.0
dtype: float64

In [20]:
grp4.describe()

        Student ID  Class  Study hrs  Social Media usage hrs  Percentage
count     2.000000    2.0   2.000000                2.000000    2.000000
mean   1002.000000   10.0   2.500000                2.500000   55.000000
std       1.414214    0.0   0.707107                0.707107    7.071068
min    1001.000000   10.0   2.000000                2.000000   50.000000
25%    1001.500000   10.0   2.250000                2.250000   52.500000
50%    1002.000000   10.0   2.500000                2.500000   55.000000
75%    1002.500000   10.0   2.750000                2.750000   57.500000
max    1003.000000   10.0   3.000000                3.000000   60.000000

In [22]:
#multiple functions
grp4.agg(['sum','max','mean'])

      Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
sum       2004.0      AA   20.0        5.0                     5.0       110.0
max       1003.0       A   10.0        3.0                     3.0        60.0
mean      1002.0     NaN   10.0        2.5                     2.5        55.0